//*************************************************************************************************
//*************************************************************************************************
//**<程序名>：串口输出																			 **
//**<功能>：通过串口把数据传给LED																 **
//**<作者>：LastRitter																			 **
//**<完成时间>：2007年7月30日																	 **
//**<联系方式>：E-Mail:superyongzhe@163.com;QQ:314665345。										 **
//*************************************************************************************************
//*************************************************************************************************
#include <at89x51.h>


unsigned  char code uca_LCDCode[]=
					{0x03,0x9F,0x25,0x0D,0x99,0x49,0x41,0x1F,0x01,0x09};
					//74LS164的LED编码：0,1,2,3,4,5,6,7,8,9
void main()
{
	unsigned char ucSelect=0;
	unsigned int uiCount;

	SM0=0;	   // 设置串口模式：模式0。
	SM1=0;

	SBUF=0xFF;
	while(TI==0); //等待发送。
	TI=0;		  //发送完毕，把TI置零。

	while(1)
	{
	if(ucSelect==9)
		ucSelect=0;
	else ucSelect++;

	SBUF=uca_LCDCode[ucSelect];
	while(TI==0);
	TI=0;

	for(uiCount=0;uiCount<30000;uiCount++);		   //延时。
	}
} 