//*************************************************************************************************
//*************************************************************************************************
//**<程序名>：按键处理子函数																 	 **
//**<功能>：当有外部中断0时调用此函数，获得键码，进行相应处理。								     **
//*************************************************************************************************
//*************************************************************************************************

extern unsigned long ul_Number;		//LCE显示数据,LCD实时显示该数字。

//*************************************************************************************************
//*																								  *
//*		 ********************************按键处理函数主函数******************************		  *
//*																								  *
//************************************************************************************************* 
void vKeyProcess(unsigned char ucKeyCode)
{
	switch(ucKeyCode)						
		{
		case 11: ul_Number=7;break;						  //'7'

		case 12: ul_Number=8;break;						  //'8'

		case 13: ul_Number=9;break;						  //'9'

		case 14: ul_Number=14;break;					  //'/'

		case 21: ul_Number=4;break;						  //'4'

		case 22: ul_Number=5;break;						  //'5'

		case 23: ul_Number=6;break;						  //'6'

		case 24: ul_Number=24;break;					  //*

		case 31: ul_Number=1;break;						  //'1'

		case 32: ul_Number=2;break;						  //'2'

		case 33: ul_Number=3;break;						  //'3'

		case 34: ul_Number=34;break;					  //'-'

		case 41: ul_Number=41;break;					  //'NO/C'

		case 42: ul_Number=0;break;						  //'0'

		case 43: ul_Number=43;break;					  //'='

		case 44: ul_Number=44;break;					  //'+'

		default:break;
		}
}

