#ifndef __SMC1602_H__
#define __SMC1602_H__

//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<LCD设置函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#define vdInitialize()	vWriteCMD(0x01);vWriteCMD(0x38);//vWriteCMD(0x0C);	//初始化
													 //省略改句是由于在Introduce.c的开始有改句。
//vWriteCMD(0x01);	  	清屏

//vWriteCMD(0x38);		显示模式设置：8位2行5x7点阵

//vWriteCMD(0x0C);		(0x0C)文字不动，光标自动右移
												
//vWriteCMD(0x0F);	    显示器开、光标开、闪烁开 


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<写数据命令函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>



void vWriteCMD(unsigned char ucCommand);		   //把1个命令写入LCD。

void vWriteData(unsigned char ucData);			   //把1个数据写入LCD。

void vShowOneChar(unsigned char ucChar);		  //在当前光标处显示1个字符。

void vShowChar(unsigned char ucaChar[]);		  //在当前光标处显示1个字符串

#endif