//*************************************************************************************************
//*************************************************************************************************
//**<程序名>：键盘和LCD。																 		 **
//**<功能>：LCD显示键盘输入。			 														 **
//**<作者>：LastRitter																			 **
//**<完成时间>：2007年8月8日																	 **
//**<联系方式>：E-Mail:superyongzhe@163.com;QQ:314665354										 **
//*************************************************************************************************
//*************************************************************************************************
#include "includes.h"

#define SCANPORT P2

void main()
{
	unsigned char ucCount;
	vdInitialize();

	vWriteCMD(0x81);

	vShowChar("In Your Order !");

	SCANPORT=0x0F;

	while(1)
	{
	if(SCANPORT!=0x0F)
		{
		for(ucCount=0;ucCount<200;ucCount++);
		
		if(SCANPORT!=0x0F)
			vKeyProcess(ucKeyScan());
		}
	}
}
